# __Nombre__: Brian Sena Simons

# Ejercicios Tidyverse
1) Utiliza el dataset de `mtcars` y el paquete `tidyverse` para:
    * Mostrar las 5 primeras filas del dataset

In [88]:
library(tidyverse)
# Podemos utilizar head(mtcars, n = 5)
# Podemos utilizar mtcars %>% head(n = 5)
# Podemos utilizar mtcars %>% slice(c(1:5))
# Podemos utilizar mtcars %>% slice_head(n = 5)
# Si indagamos en la documentación de slice nos indica que podemos:
# 1. filter(mtcars, row_number() <= 5)
# 2. filter(mtcars, between(row_number(), 1, 5))
mtcars %>% slice(1:5)

                  mpg  cyl disp hp  drat wt    qsec  vs am gear carb
Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 0  1  4    4
Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 0  1  4    4
Datsun 710        22.8 4   108   93 3.85 2.320 18.61 1  1  4    1
Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44 1  0  3    1
Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 0  0  3    2

  * Convertir la variables "cyl", "gear" y "carb" en factores y las variables "vs" y "am" en lógicas, y mostrar la estructura del dataset (usar este dataset transformado de aqui en adelante)

In [89]:
# Podemos hacerlo manualmente o crear vectores
# Manualmente:
# ```cmtcars <- mtcars %>% mutate(cyl = as.factor(cyl), ...)```
factor_cols <- c("cyl", "gear", "carb")
logical_cols <- c("vs", "am")
cmtcars <- mtcars %>%
  mutate_at(factor_cols, as.factor) %>%
  mutate_at(logical_cols, as.logical)
cmtcars %>% select(all_of(c(factor_cols, logical_cols))) %>% str

'data.frame':	32 obs. of  5 variables:
 $ cyl : Factor w/ 3 levels "4","6","8": 2 2 1 2 3 2 3 1 1 2 ...
 $ gear: Factor w/ 3 levels "3","4","5": 2 2 2 1 1 1 1 2 2 2 ...
 $ carb: Factor w/ 6 levels "1","2","3","4",..: 4 4 1 1 2 1 4 2 2 4 ...
 $ vs  : logi  FALSE FALSE TRUE TRUE FALSE TRUE ...
 $ am  : logi  TRUE TRUE TRUE FALSE FALSE FALSE ...

* Mostrar solo los coches con una potencia ("hp") mayor a 100 * Seleccionar solo las columnas "mpg", "cyl", "hp" y "qsec" del dataset

In [90]:
cmtcars %>% filter(hp > 100) %>% head(5)

                  mpg  cyl disp hp  drat wt    qsec  vs    am    gear carb
Mazda RX4         21.0 6   160  110 3.90 2.620 16.46 FALSE  TRUE 4    4
Mazda RX4 Wag     21.0 6   160  110 3.90 2.875 17.02 FALSE  TRUE 4    4
Hornet 4 Drive    21.4 6   258  110 3.08 3.215 19.44  TRUE FALSE 3    1
Hornet Sportabout 18.7 8   360  175 3.15 3.440 17.02 FALSE FALSE 3    2
Valiant           18.1 6   225  105 2.76 3.460 20.22  TRUE FALSE 3    1

* Calcular la cantidad total de coches para cada valor único en la columna "cyl" (número de cilindros)

In [91]:
# cmtcars %>% group_by(cyl) %>% summarise(n = n())
cmtcars %>% group_by(cyl) %>% count
# cmtcars %>% count(cyl)

  cyl n
1 4   11
2 6    7
3 8   14

* Encontrar el modelo de coche con la mayor potencia ("hp") y mostrar su información completa
* Calcular el promedio de potencia de los coches con 8 cilindros

In [92]:
# Una opción sería crear una columna
# Y luego filtrar cmtcars %>% mutate(hp_max = max(hp)) %>% filter(hp == hp_max)
cmtcars %>% filter(hp == max(hp))
cmtcars %>% group_by(cyl) %>% summarise(mean = mean(hp)) %>% filter(cyl == 8)
# También podemos filtrar primero los cilindros y seria más eficiente
# Por ejemplo: cmtcars %>% filter(cyl == 8) %>% summarise(mean = mean(hp))

              mpg cyl disp hp  drat wt   qsec vs    am   gear carb
Maserati Bora 15  8   301  335 3.54 3.57 14.6 FALSE TRUE 5    8

  cyl mean
1 8   209.2143

2) Supongamos que tienes un data frame llamado `lego_sets` que contiene información sobre diferentes conjuntos de Lego, incluyendo el nombre del conjunto, el número de piezas, el tema y el año de lanzamiento:

In [93]:
# Generar datos ficticios
nombres <- paste("Conjunto", 1:80)
piezas <- sample(50:1000, 80, replace = TRUE)
temas <- sample(
  c(
    "Ciudad",
    "Espacio",
    "Arquitectura",
    "Granja",
    "Dinosaurios",
    "Aventuras",
    "Piratas"
  ),
  80,
  replace = TRUE
)
anos <- sample(2000:2023, 80, replace = TRUE)

# Crear el data frame
lego_sets <- data.frame(
  Set_Name = nombres,
  Piece_Count = piezas,
  Theme = temas,
  Year = anos
)

* Filtra y muestra solo los conjuntos de Lego lanzados en el año 2020

In [94]:
lego_sets %>% filter(Year == 2020)

  Set_Name    Piece_Count Theme     Year
1 Conjunto 6  237         Piratas   2020
2 Conjunto 12 242         Piratas   2020
3 Conjunto 14 873         Ciudad    2020
4 Conjunto 25 656         Ciudad    2020
5 Conjunto 36 596         Aventuras 2020
6 Conjunto 40 939         Aventuras 2020

* Encuentra y muestra el nombre y el número de piezas del conjunto de Lego más grande

In [95]:
lego_sets %>%
  filter(Piece_Count == max(Piece_Count)) %>%
  select(Set_Name, Piece_Count)

  Set_Name    Piece_Count
1 Conjunto 71 978

* Calcula la cantidad total de piezas para cada tema y muéstralos en orden descendente por número de piezas

In [96]:
lego_sets %>%
  group_by(Theme) %>%
  summarise(total = sum(Piece_Count)) %>%
  arrange(desc(total))

  Theme        total
1 Ciudad       8993
2 Aventuras    8021
3 Espacio      6354
4 Piratas      5094
5 Dinosaurios  4661
6 Granja       4587
7 Arquitectura 3580

* Calcula cuántos conjuntos de Lego se lanzaron en cada año y muéstralo ordenado por año de forma ascendente

In [97]:
lego_sets %>%
  group_by(Year) %>%
  summarise(total = n()) %>%
  arrange(Year)

   Year total
1  2000 3
2  2001 3
3  2002 3
4  2003 3
5  2004 2
6  2005 3
7  2006 4
8  2008 4
9  2009 6
10 2010 3
11 2011 5
12 2012 2
13 2013 4
14 2014 3
15 2015 1
16 2016 1
17 2017 3
18 2018 5
19 2019 4
20 2020 6
21 2021 6
22 2022 3
23 2023 3


* Encuentra los 3 temas más populares (con más conjuntos) y muestra el número de conjuntos y el número total de piezas para cada uno de ellos

In [98]:
lego_sets %>%
  group_by(Theme) %>%
  summarise(conjuntos = n(), total_piezas = sum(Piece_Count)) %>%
  arrange(desc(conjuntos)) %>%
  slice_head(n = 3)

  Theme     conjuntos total_piezas
1 Ciudad    14        8993
2 Piratas   14        5094
3 Aventuras 13        8021

3) Dado un data frame llamado `bebidas` que contiene información sobre la edad, género, tipo de bebida y cantidad de copas consumidas por un grupo de personas, filtra y muestra únicamente a las mujeres mayores de 20 años. Para este suconjunto calcula la media, el máximo, la cantidad de copas totales y la desviación estándar de la edad para cada combinación de tipo de bebida. Finalemnte, agrega una nueva columna que indique cuántas personas se encuentran en cada grupo de tipo de bebida.

In [99]:
# Generar datos ficticios
set.seed(42)
num_elementos <- 100
edades <- sample(18:70, num_elementos, replace = TRUE)
sexos <- sample(c("Hombre", "Mujer"), num_elementos, replace = TRUE)
tipos_bebida <- sample(
  c("Cerveza", "Vino", "Refresco", "Cóctel", "Agua"),
  num_elementos,
  replace = TRUE
)
cantidad_copas <- sample(1:5, num_elementos, replace = TRUE)

# Crear el data frame de bebidas
bebidas <- data.frame(
  Edad = edades,
  Sexo = sexos,
  Bebida = tipos_bebida,
  Copas = cantidad_copas
)

# Necesitamos computar el total de personas agrupadas por Bebida primero.
personas <- bebidas %>% group_by(Bebida) %>% count(name = "total_personas")
# Ahora podemos computar los datos para las el subconjunto de mujeres.
mujeres <- bebidas %>%
  filter(Sexo == "Mujer" & Edad > 20) %>%
  group_by(Bebida) %>%
  summarise(
    mean = mean(Copas),
    max = max(Copas),
    sd = sd(Edad),
    total_mujeres_mayor_20 = n(),
  ) %>%
  arrange(total_mujeres_mayor_20)
mujeres %>% merge(personas, by = "Bebida")

  Bebida   mean     max sd       total_mujeres_mayor_20 total_personas
1 Agua     2.363636 5   17.02405 11                     17
2 Cerveza  2.615385 5   13.37190 13                     27
3 Cóctel   3.384615 5   11.99733 13                     20
4 Refresco 3.000000 5   16.86120  5                     17
5 Vino     3.181818 5   12.24299 11                     19

In [100]:
# Para verificarlo podemos observar el conjunto Refresco.
bebidas %>% filter(Bebida == "Refresco") %>% arrange(Sexo)
# Vemos correctamente 5 mujeres y 13 hombres

   Edad Sexo   Bebida   Copas
1  66   Hombre Refresco 3
2  41   Hombre Refresco 5
3  63   Hombre Refresco 2
4  67   Hombre Refresco 3
5  42   Hombre Refresco 5
6  44   Hombre Refresco 2
7  62   Hombre Refresco 3
8  62   Hombre Refresco 2
9  41   Hombre Refresco 5
10 38   Hombre Refresco 1
11 46   Hombre Refresco 5
12 63   Hombre Refresco 5
13 25   Mujer  Refresco 5
14 66   Mujer  Refresco 1
15 66   Mujer  Refresco 4
16 57   Mujer  Refresco 2
17 53   Mujer  Refresco 3

4) Dado un data frame llamado `peliculas`, indique los 2 géneros con mayor puntuación media por país pero solo de peliculas para mayores de 13 o superiores, que incluya el número de películas en ese género, su beneficio medio (ganancia-presupuesto), la desviación estándar de la puntuación y la puntuación media. Ordenar los resultados por puntuación media por país de forma descendente.

In [101]:
# Crear un data frame con 150 filas
num_filas <- 150

# Generar datos ficticios
set.seed(123)  # Para reproducibilidad
paises <- sample(
  c("EE. UU.", "Reino Unido", "Francia", "España", "Italia"),
  num_filas,
  replace = TRUE
)
nombres <- paste("Película", 1:num_filas)
anos <- sample(1980:2023, num_filas, replace = TRUE)
puntuaciones <- round(runif(num_filas, 1, 10), 1)
tematicas <- sample(
  c("Acción", "Drama", "Comedia", "Ciencia Ficción", "Animación"),
  num_filas,
  replace = TRUE
)
directores <- paste("Director", 1:num_filas)
companias <- sample(
  c(
    "Warner Bros.",
    "Universal Pictures",
    "Disney",
    "Sony Pictures",
    "Paramount Pictures"
  ),
  num_filas,
  replace = TRUE
)
presupuestos <- round(runif(num_filas, 1000000, 50000000), 2)
ganancias <- round(presupuestos * runif(num_filas, 0.5, 2.5), 2)
ratings_ <- c("G", "PG", "PG-13", "R", "NC-17")
ratings <- sample(
  ratings_, num_filas, replace = TRUE
)  # Columna de rating ficticio

# Crear el data frame
peliculas <- data.frame(
  Pais = paises,
  Nombre = nombres,
  Ano = anos,
  Puntuacion = puntuaciones,
  Tematica = tematicas,
  Director = directores,
  Compañía = companias,
  Presupuesto = presupuestos,
  Ganancia = ganancias,
  Rating = ratings
)

In [108]:
# Según wikipedia:
# https://es.wikipedia.org/wiki/Clasificaci%C3%B3n_por_edades_(cine)
# Las clasificaciones para mayores de 13 sería > PG-13
peliculas <- peliculas %>%
  mutate(Rating = factor(ratings, levels = ratings_, ordered = TRUE))
peliculas %>% str
top_peliculas <- peliculas %>%
  filter(Rating > "PG-13") %>%
  group_by(Pais, Tematica) %>%
  summarise(
    numero_peliculas = n(),
    beneficio_medio = mean(Ganancia - Presupuesto),
    desviacion_puntuacion = sd(Puntuacion),
    media_puntuacion = mean(Puntuacion),
  ) %>%
  arrange(desc(media_puntuacion)) %>%
  mutate(rank = row_number()) %>%
  filter(rank <= 2) %>%
  arrange(Pais, desc(media_puntuacion))
top_peliculas

'data.frame':	150 obs. of  10 variables:
 $ Pais       : chr  "Francia" "Francia" "Reino Unido" "Reino Unido" ...
 $ Nombre     : chr  "Película 1" "Película 2" "Película 3" "Película 4" ...
 $ Ano        : int  2003 2002 2005 2022 2012 2008 1989 1992 2022 1990 ...
 $ Puntuacion : num  3.1 7.2 3.5 8.3 1.8 8.4 4.8 7.8 7 5 ...
 $ Tematica   : chr  "Ciencia Ficción" "Drama" "Drama" "Comedia" ...
 $ Director   : chr  "Director 1" "Director 2" "Director 3" "Director 4" ...
 $ Compañía   : chr  "Paramount Pictures" "Paramount Pictures" "Sony Pictures" "Universal Pictures" ...
 $ Presupuesto: num  47585481 33366083 4542042 41490247 24497660 ...
 $ Ganancia   : num  1.17e+08 5.52e+07 4.53e+06 7.18e+07 1.38e+07 ...
 $ Rating     : Ord.factor w/ 5 levels "G"<"PG"<"PG-13"<..: 1 1 5 4 5 4 5 5 1 2 ...

`summarise()` has grouped output by 'Pais'. You can override using the
`.groups` argument.

   Pais        Tematica        numero_peliculas beneficio_medio
1  EE. UU.     Comedia         5                 4699648
2  EE. UU.     Acción          3                 4022957
3  España      Drama           3                20685734
4  España      Ciencia Ficción 3                12778839
5  Francia     Comedia         4                15326307
6  Francia     Ciencia Ficción 2                -2180948
7  Italia      Acción          4                 7693685
8  Italia      Ciencia Ficción 1                 -160740
9  Reino Unido Acción          4                 6219085
10 Reino Unido Comedia         5                15163272
   desviacion_puntuacion media_puntuacion rank
1  2.850965              6.460            1
2  2.170253              6.200            2
3  2.778489              7.100            1
4  2.351595              5.800            2
5  2.495830              7.275            1
6  4.808326              6.400            2
7  2.017424              7.450            1
8        NA              6.300            2
9  2.410221              6.525            1
10 2.522499              5.960            2

5) Dado un conjunto de datos llamado notas que contiene información sobre las notas de los estudiantes en varias asignaturas, agrega una columna con la nota promedio de cada estudiante. Previamente reemplaza los valores faltantes con 0 (HINT: usa replace_na).

In [103]:
# Generar datos ficticios
set.seed(42)
estudiantes <- paste("Estudiante", 1:50)
notas_matematicas <- sample(c(NA, 5, 6, 7, 8, 9, 10), 50, replace = TRUE)
notas_historia <- sample(c(NA, 4, 5, 6, 7, 8), 50, replace = TRUE)
notas_ciencias <- sample(c(NA, 6, 7, 8, 9, 10), 50, replace = TRUE)

# Crear el data frame
notas <- data.frame(
  Estudiante = estudiantes,
  Nota_Matematicas = notas_matematicas,
  Nota_Historia = notas_historia,
  Nota_Ciencias = notas_ciencias
)

In [104]:
final <- notas %>%
  replace_na(
    list(
      Nota_Matematicas = 0,
      Nota_Historia = 0,
      Nota_Ciencias = 0
    )
  ) %>%
  group_by(Estudiante) %>%
  summarise(
    across(
      c(Nota_Matematicas, Nota_Historia, Nota_Ciencias),
      .fns = mean,
    ),
  ) %>%
  # Ahora solo ponemos los resultados un poco más bonito
  rename(
    media_ciencias = Nota_Ciencias,
    media_historia = Nota_Historia,
    media_mates = Nota_Matematicas
  ) %>%
  extract(Estudiante, "id", regex = "([0-9]+)", remove = FALSE) %>%
  mutate(id = as.numeric(id)) %>%
  arrange(id) %>%
  select(-id)
final

   Estudiante    media_mates media_historia media_ciencias
1  Estudiante 1   0          5               9
2  Estudiante 2   8          0              10
3  Estudiante 3   0          7               7
4  Estudiante 4   0          4              10
5  Estudiante 5   5          4               8
6  Estudiante 6   7          8               9
7  Estudiante 7   5          8               0
8  Estudiante 8   5          4               8
9  Estudiante 9   0          6               0
10 Estudiante 10 10          5               0
11 Estudiante 11 10          8               9
12 Estudiante 12  7          7              10
13 Estudiante 13  0          4               7
14 Estudiante 14  8          8               0
15 Estudiante 15  9          4               6
16 Estudiante 16  7          4               9
17 Estudiante 17  5          7              10
18 Estudiante 18  5          0               0
19 Estudiante 19 10          0               9
20 Estudiante 20  6          6              10
21 Estudiante 21  0          7               9
22 Estudiante 22  0          4               0
23 Estudiante 23  6          0               6
24 Estudiante 24  7          7               7
25 Estudiante 25  8          6               6
26 Estudiante 26 10          6               6
27 Estudiante 27  8          0               0
28 Estudiante 28  8          5               7
29 Estudiante 29  7          5               0
30 Estudiante 30  5          7               9
31 Estudiante 31  7          7               0
32 Estudiante 32  6          6               7
33 Estudiante 33  5          8               0
34 Estudiante 34  0          7              10
35 Estudiante 35  5          6              10
36 Estudiante 36  9          8              10
37 Estudiante 37  6          4               7
38 Estudiante 38 10          4              10
39 Estudiante 39  9          0               9
40 Estudiante 40  5          4               0
41 Estudiante 41  7          7              10
42 Estudiante 42  7          8               0
43 Estudiante 43  9          7               6
44 Estudiante 44  5          6               6
45 Estudiante 45  8          0              10
46 Estudiante 46  7          6              10
47 Estudiante 47  8          4              10
48 Estudiante 48  7          4              10
49 Estudiante 49  5          5              10
50 Estudiante 50  5          7               8